CSI API ETABS v1

# cPluginCallback Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cPluginCallback

    Public Interface cPluginCallback

    Dim instance As cPluginCallback

    public interface class cPluginCallback

    type cPluginCallback =  interface end

The cPluginCallback type exposes the following members.

Properties

| Name| Description
---|---|---
|
ErrorFlag|  Indicates whether an
error occurred
|
Finished|  Indicates whether the
plugin is finished
Top

Methods

| Name| Description
---|---|---
|
Finish|  This method must be
called when the plugin has finished.
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com